// Пусть матрицы вещественных чисел A, B заданы на нулевом процессе. Написать программу, в которой матрицы
// равными кусками с нулевого процесса пересылаются остальным процессам. Пересылка данных осуществляется
// функцией MPI_Send. Все процессы по формуле вычисляют свои элементы искомых матриц. Каждый процесс отправляет
// на нулевой процесс подсчитанные элементы матриц. Реализовать приведение матрицы к нижнему треугольному виду
// методом исключения Гаусса.

#include <iostream>
#include <sstream>
#include <ctime>
#include <mpi.h>

int main(int argc, char *argv[]) {

    return 0;
}